In [0]:
import pandas as pd
from pandas import Series, DataFrame

In [0]:
print("Pandas Version : ", pd.__version__)

Pandas Version :  0.24.2

In [0]:
## 홍길동 팀의 5일간 점수
## 날짜를 인덱스로 넣어서  Series객체 만들기

scores1=[1000,14000,3000,3000,1000]
date=["2019-10-06","2019-10-07","2019-10-08","2019-10-09","2019-10-10"]
gildong=Series(scores, index=date)
gildong

2019-10-06    3000
2019-10-07    4200
2019-10-08     340
2019-10-09    2640
2019-10-10    7430
dtype: int64

In [0]:
## 토토 팀의 5일간 점수
## 날짜를 인덱스로 넣어서  Series객체 만들기

scores2=[3000,4200,340,2640,7430]
toto=Series(scores,index=date)
toto

2019-10-06    3000
2019-10-07    4200
2019-10-08     340
2019-10-09    2640
2019-10-10    7430
dtype: int64

In [0]:
## 두팀의 데이터 프레임 만들기
score=pd.DataFrame({"gildong":scores1,"toto":scores2},index=date)
score

            gildong  toto
2019-10-06     1000  3000
2019-10-07    14000  4200
2019-10-08     3000   340
2019-10-09     3000  2640
2019-10-10     1000  7430

In [0]:
import numpy as np
scores3=[]
for i in range(5):
  score=np.random.randint(1,20000)
  scores3.append(score)

scores3

[14822, 16543, 9969, 4248, 5422]

In [0]:
apple=[4000,5000,6000,5500,4500]
catanddog=[7000,5000,3000,5000,4000]

score=pd.DataFrame({"gildong":scores1,"apple":apple,"toto":scores2,"catanddog":catanddog},index=date)
score

            gildong  apple  toto  catanddog
2019-10-06     1000   4000  3000       7000
2019-10-07    14000   5000  4200       5000
2019-10-08     3000   6000   340       3000
2019-10-09     3000   5500  2640       5000
2019-10-10     1000   4500  7430       4000

In [0]:
#점수의 총 합을 만들어 보자
score["total"]=score["gildong"]+score["apple"]+score["toto"]+score["catanddog"]
score

            gildong  apple  toto  catanddog  total
2019-10-06     1000   4000  3000       7000  15000
2019-10-07    14000   5000  4200       5000  28200
2019-10-08     3000   6000   340       3000  12340
2019-10-09     3000   5500  2640       5000  16140
2019-10-10     1000   4500  7430       4000  16930

In [0]:
#행,열의 번호로 접근
score.iloc[:2,:]

            gildong  apple  toto  catanddog  total
2019-10-06     1000   4000  3000       7000  15000
2019-10-07    14000   5000  4200       5000  28200

In [0]:
#행,열 명칭으로 접근
#apple,catanddog 선택
score.loc[:,["apple","catanddog"]]

            apple  catanddog
2019-10-06   4000       7000
2019-10-07   5000       5000
2019-10-08   6000       3000
2019-10-09   5500       5000
2019-10-10   4500       4000

In [0]:
score.loc["2019-10-06":"2019-10-07"]

            gildong  apple  toto  catanddog  total
2019-10-06     1000   4000  3000       7000  15000
2019-10-07    14000   5000  4200       5000  28200

In [0]:
s1=score.drop(["total"],axis=1)
s1

            gildong  apple  toto  catanddog
2019-10-06     1000   4000  3000       7000
2019-10-07    14000   5000  4200       5000
2019-10-08     3000   6000   340       3000
2019-10-09     3000   5500  2640       5000
2019-10-10     1000   4500  7430       4000

In [0]:
s2=s1.drop(["2019-10-07","2019-10-08"],axis=0)
s2

            gildong  apple  toto  catanddog
2019-10-06     1000   4000  3000       7000
2019-10-09     3000   5500  2640       5000
2019-10-10     1000   4500  7430       4000

In [0]:
score.sort_values("total",ascending=False)  #ascending=True 오름차순  ascending=False 내림차순  


#DataFrame.sort_values(by=None,  #정렬 기준 변수
 #                    axis=0,  
  #                   ascending=True,  #ascending=True 오름차순  ascending=False 내림차순 
   #                  inplace=False,   #DataFrame자체를 정렬해서 저장
    #                 kind="quicksort",  #정렬알고리즘
     #                na_position="last")  #결측값 위치  {"first","last"}

            gildong  apple  toto  catanddog  total
2019-10-07    14000   5000  4200       5000  28200
2019-10-10     1000   4500  7430       4000  16930
2019-10-09     3000   5500  2640       5000  16140
2019-10-06     1000   4000  3000       7000  15000
2019-10-08     3000   6000   340       3000  12340

In [0]:
np.sum(score,axis=0).tolist()

[22000, 25000, 17610, 24000, 88610]